call 新增供应商("白云制药","王安","12345678910","广州小谷围街道") ;
call 新增供应商("云南制药","枣波","12345678910","广州小谷围街道") ;
call 新增供应商("同仁堂","希希","12345678910","广州小谷围街道") ;
call 新增供应商("阿巴阿巴","阿达","12345678910","广州小谷围街道") ;

call 新增会员("黄豆豆","12345678910") ;
call 新增会员("崔小小","12345678910") ;
call 新增会员("梁丽丽","12345678910") ;

call 新增药品("布洛芬","1","12345678","上海","西药","3.5","5.5","0.90","10*2","2021-12-30","2022-12-30") ;
call 新增药品("氨茶碱","3","12345678","上海","西药","3.5","5.5","0.90","10*2","2021-12-30","2022-12-30") ;
call 新增药品("黄连上清片","2","12345678","上海","中药","3.5","5.5","0.90","10*2","2021-12-30","2022-12-30") ;

call 新增登录用户("root","1234","2","鬼鬼","12345678901");
call 用户注册("费列罗","1234","1","球球","12345678901");
call 用户注册("臭方方","1234","2","翡居","12345678901");

call 入库登记("1","2","100","1");
call 入库登记("3","1","50","2");
call 入库登记("2","1","10","3");

call 入库登记("1","2","1000","1");

call 销售登记("1","2","10","1");
call 销售登记("2","2","2","2");
call 销售登记("1","2","1000","3"); 

call 退货登记 ("5","2") ;
call 退货登记 ("6","2") ;